icoFoam_Cavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        nFaces          500;
        startFace       960;
    }
    movingWall
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       1460;
    }
    fixedWalls
    {
        type            patch;
        physicalType    patch;
        nFaces          60;
        startFace       1480;
    }
)

// ************************************************************************* //
